### Aula-02-10-Agosto-2021-Python-Fundamentos-Dicionarios-DataFrames.ipynb

# Tuplas

In [1]:
t1 = ('Vacinas', True, 20)
t1

('Vacinas', True, 20)

In [2]:
type(t1)

tuple

In [3]:
t1[0]

'Vacinas'

In [4]:
t1[0] = 1

TypeError: 'tuple' object does not support item assignment

In [5]:
l = list(t1)
type(l)

list

In [7]:
l

['Vacinas', True, 20]

In [9]:
l[0] = 1

In [10]:
l

[1, True, 20]

In [11]:
del t1

# Dicionário

In [12]:
d1 = { 'Pedro': 19, 'Marina': 22,  "Andre": 28}

In [13]:
type(d1)

dict

In [14]:
d1

{'Pedro': 19, 'Marina': 22, 'Andre': 28}

In [15]:
d1['Marina']

22

In [16]:
d1.items()

dict_items([('Pedro', 19), ('Marina', 22), ('Andre', 28)])

In [17]:
d1.keys()

dict_keys(['Pedro', 'Marina', 'Andre'])

In [18]:
d1.values()

dict_values([19, 22, 28])

In [19]:
d1['David'] = 32
d1

{'Pedro': 19, 'Marina': 22, 'Andre': 28, 'David': 32}

In [20]:
d2 = { 12: "CCT", 'a': True}
d2

{12: 'CCT', 'a': True}

In [21]:
d1

{'Pedro': 19, 'Marina': 22, 'Andre': 28, 'David': 32}

In [22]:
d1.update(d2)
d1

{'Pedro': 19, 'Marina': 22, 'Andre': 28, 'David': 32, 12: 'CCT', 'a': True}

In [23]:
d1['Endereco'] = [ 'Av. Floriano Peixoto', 1023, 'Bodocongó' ]
d1

{'Pedro': 19,
 'Marina': 22,
 'Andre': 28,
 'David': 32,
 12: 'CCT',
 'a': True,
 'Endereco': ['Av. Floriano Peixoto', 1023, 'Bodocongó']}

In [25]:
d1['Endereco']

['Av. Floriano Peixoto', 1023, 'Bodocongó']

In [26]:
d1['Endereco'][2]

'Bodocongó'

In [27]:
d1['Endereco2'] = {'rua': 'Av. Floriano Peixoto', 
                   'Numero': 1023,
                   'Bairro':'Bodocongó'}
d1

{'Pedro': 19,
 'Marina': 22,
 'Andre': 28,
 'David': 32,
 12: 'CCT',
 'a': True,
 'Endereco': ['Av. Floriano Peixoto', 1023, 'Bodocongó'],
 'Endereco2': {'rua': 'Av. Floriano Peixoto',
  'Numero': 1023,
  'Bairro': 'Bodocongó'}}

In [28]:
d1.keys()

dict_keys(['Pedro', 'Marina', 'Andre', 'David', 12, 'a', 'Endereco', 'Endereco2'])

In [29]:
d1['Endereco2']

{'rua': 'Av. Floriano Peixoto', 'Numero': 1023, 'Bairro': 'Bodocongó'}

In [30]:
d1['Endereco2']['rua']

'Av. Floriano Peixoto'

In [31]:
rua = d1['Endereco2']['rua']
rua

'Av. Floriano Peixoto'

In [32]:
d1

{'Pedro': 19,
 'Marina': 22,
 'Andre': 28,
 'David': 32,
 12: 'CCT',
 'a': True,
 'Endereco': ['Av. Floriano Peixoto', 1023, 'Bodocongó'],
 'Endereco2': {'rua': 'Av. Floriano Peixoto',
  'Numero': 1023,
  'Bairro': 'Bodocongó'}}

In [33]:
d1['Marina'] = d1['Marina'] + 3
d1['Marina']

25

In [34]:
d1['Marina'] +=  3
d1['Marina']

28

## Expressoes Lambda

In [35]:
def potencia(x):
    return x * x

potencia(3)

9

In [36]:
pot = lambda x : x * x

In [37]:
pot(3)

9

In [38]:
addNum = lambda x,y : x + y

In [39]:
addNum(2,3)

5

# Comando for

In [40]:
range(10)

range(0, 10)

In [41]:
list(range(10))

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [42]:
range(1,11)

range(1, 11)

In [43]:
list(range(1,11)) # Exclusive = indice - 1 = 11 - 1 = 10

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [44]:
for i in range(10): 
    print(i)

0
1
2
3
4
5
6
7
8
9

In [45]:
l = ['Pedro', 'Marina', 'Andre', 10]
l

['Pedro', 'Marina', 'Andre', 10]

In [46]:
for elem in l:
    print(elem)

Pedro
Marina
Andre
10

In [48]:
c = 0
while c < 10:
    print(c)
    c += 1

0
1
2
3
4
5
6
7
8
9

In [50]:
c = 0
while c < 10:
    print(c)
    c += 1
    
    if c == 5:
        break
print(c)

0
1
2
3
4
5

In [51]:
d1

{'Pedro': 19,
 'Marina': 28,
 'Andre': 28,
 'David': 32,
 12: 'CCT',
 'a': True,
 'Endereco': ['Av. Floriano Peixoto', 1023, 'Bodocongó'],
 'Endereco2': {'rua': 'Av. Floriano Peixoto',
  'Numero': 1023,
  'Bairro': 'Bodocongó'}}

In [52]:
for elem in d1:
    print(elem)

Pedro
Marina
Andre
David
12
a
Endereco
Endereco2

In [55]:
for elem in d1.values():
    print(elem)

19
28
28
32
CCT
True
['Av. Floriano Peixoto', 1023, 'Bodocongó']
{'rua': 'Av. Floriano Peixoto', 'Numero': 1023, 'Bairro': 'Bodocongó'}

In [56]:
d1.items()

dict_items([('Pedro', 19), ('Marina', 28), ('Andre', 28), ('David', 32), (12, 'CCT'), ('a', True), ('Endereco', ['Av. Floriano Peixoto', 1023, 'Bodocongó']), ('Endereco2', {'rua': 'Av. Floriano Peixoto', 'Numero': 1023, 'Bairro': 'Bodocongó'})])

In [57]:
for chave, valor in d1.items():
    print(chave, ' : ', valor)

Pedro  :  19
Marina  :  28
Andre  :  28
David  :  32
12  :  CCT
a  :  True
Endereco  :  ['Av. Floriano Peixoto', 1023, 'Bodocongó']
Endereco2  :  {'rua': 'Av. Floriano Peixoto', 'Numero': 1023, 'Bairro': 'Bodocongó'}

# DataFrames

In [58]:
import pandas as pd

In [59]:
df = pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [60]:
type(df)

pandas.core.frame.DataFrame

In [61]:
df['nome'] = ['Maria', 'Pedro']
df

    nome
0  Maria
1  Pedro

In [62]:
df['idade'] = [19, 22]
df

    nome  idade
0  Maria     19
1  Pedro     22

In [63]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   nome    2 non-null      object
 1   idade   2 non-null      int64
dtypes: int64(1), object(1)
memory usage: 160.0+ bytes

Posicao,Pais,Ouro,Prata,Bronze,Total <br>
1,United States of America,39,41,33,113<br>
2,People's Republic of China,38,32,18,88 <br>
3,Japan,27,14,17,58<br>
4,Great Britain,22,21,22,65<br>
12,Brazil,7,6,8,21<br>

In [64]:
data = {
    'Posicao': [1, 2, 3, 4, 12],
    'Pais': ['United States of America', 'China', 'Japan', 'UK', ' Brasil' ],
    'Total': [113, 88, 58, 65, 21]
}

In [65]:
data

{'Posicao': [1, 2, 3, 4, 12],
 'Pais': ['United States of America', 'China', 'Japan', 'UK', ' Brasil'],
 'Total': [113, 88, 58, 65, 21]}

In [66]:
type(data)

dict

In [67]:
df = pd.DataFrame(data)
df

   Posicao                      Pais  Total
0        1  United States of America    113
1        2                     China     88
2        3                     Japan     58
3        4                        UK     65
4       12                    Brasil     21

In [68]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Posicao  5 non-null      int64
 1   Pais     5 non-null      object
 2   Total    5 non-null      int64
dtypes: int64(2), object(1)
memory usage: 248.0+ bytes

In [69]:
df.Pais

0    United States of America
1                       China
2                       Japan
3                          UK
4                      Brasil
Name: Pais, dtype: object

In [70]:
df['Pais']

0    United States of America
1                       China
2                       Japan
3                          UK
4                      Brasil
Name: Pais, dtype: object

In [71]:
df['Pais'].values

array(['United States of America', 'China', 'Japan', 'UK', ' Brasil'],
      dtype=object)

In [72]:
v = df['Pais'].values
v

array(['United States of America', 'China', 'Japan', 'UK', ' Brasil'],
      dtype=object)

In [73]:
v[0]

'United States of America'

In [74]:
total = df.Total.values
total

array([113,  88,  58,  65,  21])

In [75]:
df

   Posicao                      Pais  Total
0        1  United States of America    113
1        2                     China     88
2        3                     Japan     58
3        4                        UK     65
4       12                    Brasil     21

In [76]:
df[ ["Pais", "Total" ] ]

                       Pais  Total
0  United States of America    113
1                     China     88
2                     Japan     58
3                        UK     65
4                    Brasil     21

# Leitura Dataframe com url

In [77]:
url = 'https://raw.githubusercontent.com/vladimiralencar/Alunos-UEPB-TopicosEspeciaisEmBancoDeDados/master/Python-Para-Analise-de-Dados/Olympics2020Medals.csv'

In [78]:
url

'https://raw.githubusercontent.com/vladimiralencar/Alunos-UEPB-TopicosEspeciaisEmBancoDeDados/master/Python-Para-Analise-de-Dados/Olympics2020Medals.csv'

In [79]:
df = pd.read_csv(url)
df.head()

  Posicao                        Pais  Ouro  Prata  Bronze  Total  Rank_total
0       1    United States of America  39.0   41.0    33.0  113.0         1.0
1       2  People's Republic of China  38.0   32.0    18.0   88.0         2.0
2       3                       Japan  27.0   14.0    17.0   58.0         5.0
3       4               Great Britain  22.0   21.0    22.0   65.0         4.0
4       5                         ROC  20.0   28.0    23.0   71.0         3.0

In [80]:
df.columns

Index(['Posicao', 'Pais', 'Ouro', 'Prata', 'Bronze', 'Total', 'Rank_total'], dtype='object')

In [81]:
atributos = ['Posicao', 'Pais', 'Ouro', 'Prata', 'Bronze', 'Total']
atributos

['Posicao', 'Pais', 'Ouro', 'Prata', 'Bronze', 'Total']

In [83]:
df2 = df[atributos]
df2.head()

  Posicao                        Pais  Ouro  Prata  Bronze  Total
0       1    United States of America  39.0   41.0    33.0  113.0
1       2  People's Republic of China  38.0   32.0    18.0   88.0
2       3                       Japan  27.0   14.0    17.0   58.0
3       4               Great Britain  22.0   21.0    22.0   65.0
4       5                         ROC  20.0   28.0    23.0   71.0

In [84]:
df2.tail()

   Posicao                  Pais  Ouro  Prata  Bronze  Total
92      86  Syrian Arab Republic   0.0    0.0     1.0    1.0
93       .                   NaN   NaN    NaN     NaN    NaN
94     NaN                   NaN   NaN    NaN     NaN    NaN
95     NaN                   NaN   NaN    NaN     NaN    NaN
96       .                   NaN   NaN    NaN     NaN    NaN

In [85]:
len(df2)

97

In [89]:
df2.describe().T

        count       mean        std  min  25%  50%   75%    max
Ouro     93.0   3.655914   7.022471  0.0  0.0  1.0   3.0   39.0
Prata    93.0   3.634409   6.626339  0.0  0.0  1.0   4.0   41.0
Bronze   93.0   4.322581   6.210372  0.0  1.0  2.0   5.0   33.0
Total    93.0  11.612903  19.091332  1.0  2.0  4.0  11.0  113.0